<img src="Tarjeta.png">

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Lo-hacemos-con-el-DataFrame:" data-toc-modified-id="Lo-hacemos-con-el-DataFrame:-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Lo hacemos con el DataFrame:</a></span></li><li><span><a href="#Lo-hacemos-con-la-BBDD" data-toc-modified-id="Lo-hacemos-con-la-BBDD-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Lo hacemos con la BBDD</a></span></li><li><span><a href="#Si-no-queremos-todos-los-campos,-los-borramos:" data-toc-modified-id="Si-no-queremos-todos-los-campos,-los-borramos:-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Si no queremos todos los campos, los borramos:</a></span></li><li><span><a href="#Lo-hacemos-con-el-DataFrame:" data-toc-modified-id="Lo-hacemos-con-el-DataFrame:-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Lo hacemos con el DataFrame:</a></span></li><li><span><a href="#Lo-hacemos-en-la-base-de-datos:" data-toc-modified-id="Lo-hacemos-en-la-base-de-datos:-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Lo hacemos en la base de datos:</a></span></li><li><span><a href="#Quitamos-los-campos-que-no-queremos:" data-toc-modified-id="Quitamos-los-campos-que-no-queremos:-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Quitamos los campos que no queremos:</a></span></li><li><span><a href="#Lo-hacemos-con-el-DataFrame:" data-toc-modified-id="Lo-hacemos-con-el-DataFrame:-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Lo hacemos con el DataFrame:</a></span></li><li><span><a href="#Lo-hacemos-en-la-base-de-datos:" data-toc-modified-id="Lo-hacemos-en-la-base-de-datos:-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Lo hacemos en la base de datos:</a></span></li><li><span><a href="#Quitamos-los-campos-que-no-queremos:" data-toc-modified-id="Quitamos-los-campos-que-no-queremos:-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Quitamos los campos que no queremos:</a></span></li><li><span><a href="#Lo-hacemos-con-el-DataFrame:" data-toc-modified-id="Lo-hacemos-con-el-DataFrame:-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Lo hacemos con el DataFrame:</a></span></li><li><span><a href="#Lo-hacemos-en-la-base-de-datos:" data-toc-modified-id="Lo-hacemos-en-la-base-de-datos:-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Lo hacemos en la base de datos:</a></span></li></ul></div>

In [1]:
from sqlalchemy import create_engine
import sqlalchemy
import mysql

# importo pandas y numpy:
import numpy as np
import pandas as pd 

SQLServer='sqllab.sytes.net'

In [2]:
# cadena de conexión
user='nuclio7'
password='Nuclio7Mad321'
bbdd='scott7db'
#sCadenaConexion = "mysql+mysqlconnector://nuclio1:Nuclio1Mad321@sqllab.sytes.net/scott1db"
sCadenaConexion = "mysql+mysqlconnector://"+user+":"+password+"@"+SQLServer+"/"+bbdd
# Pintamos la cadena de conexion:
print(sCadenaConexion)
# instanciamos engine como resultado de create_engine
con = create_engine(sCadenaConexion).connect()

mysql+mysqlconnector://nuclio7:Nuclio7Mad321@sqllab.sytes.net/scott7db

# JOINTS

![title](http://andresml.sytes.net/resources_classes/Data-Base.JPG)

In [3]:
# Leemos la tabla customers en un DataFrame
df_customers=pd.read_sql("SELECT * FROM customers", con=con)

In [4]:
# Leemos la tabla orders en un DataFrame
df_orders=pd.read_sql("SELECT * FROM orders", con=con)

In [5]:
df_customers

  cust_id    name country
0       a   Alice      us
1       b     Bob      ca
2       c  Carlos      mx
3       d  Dieter      de

In [6]:
df_orders

   order_id cust_id  total
0         1       a   1539
1         2       c   1871
2         3       a   6352
3         4       b   1456
4         5       z   2137

# INNER JOIN
Hacemos el inner join de los dos dataset anteriores

![title](http://andresml.sytes.net/resources_classes/Data-Base.JPG)


![title](http://andresml.sytes.net/resources_classes/Inner-Join.JPG)

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/pandas-Inner-join.jpg)

## Lo hacemos con el DataFrame:

In [14]:
df_pedidos=pd.merge(df_customers, df_orders, on=['cust_id'], how='inner')
df_pedidos

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       a   Alice      us         3   6352
2       b     Bob      ca         4   1456
3       c  Carlos      mx         2   1871

## Lo hacemos con la BBDD

In [17]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
INNER JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       c  Carlos      mx         2   1871
2       a   Alice      us         3   6352
3       b     Bob      ca         4   1456

## Si no queremos todos los campos, los borramos:

In [19]:
df_customers.drop('country', axis=1)

  cust_id    name
0       a   Alice
1       b     Bob
2       c  Carlos
3       d  Dieter

In [20]:
df_orders.drop('order_id', axis=1)

  cust_id  total
0       a   1539
1       c   1871
2       a   6352
3       b   1456
4       z   2137

In [21]:
df_pedidos=pd.merge( df_customers.drop('country', axis=1) , df_orders.drop('order_id', axis=1) , on=['cust_id'], how='inner')
df_pedidos

  cust_id    name  total
0       a   Alice   1539
1       a   Alice   6352
2       b     Bob   1456
3       c  Carlos   1871

In [7]:
sSQL = """
SELECT c.cust_id,name, total
FROM   customers c
INNER JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name  total
0       a   Alice   1539
1       c  Carlos   1871
2       a   Alice   6352
3       b     Bob   1456

# LEFT JOIN

Un Left Join **devuelve todos los elementos de la tabla de la izquierda** y sólo los elementos de la tabla derecha que machean con la tabla de la izquierda.

Es decir, la versión x de las columnas (de la tabla de la izquierda) consiste en todos los elementos de la tabla de la izquierda, los que machean y los que no, mientras que la versión y de las columnas (de la tabla de la derecha) sólo los elementas que machean con la tabla de la izquierda

Hacemos el left join de los dos dataset anteriores

![title](http://andresml.sytes.net/resources_classes/left-joins-exp.JPG)


![title](http://andresml.sytes.net/resources_classes/Left-Join.JPG)

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-left-Join.jpg)

## Lo hacemos con el DataFrame:

In [23]:
df_pedidos=pd.merge(df_customers,df_orders, on=['cust_id'], how='left')
df_pedidos

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       a   Alice      us       3.0  6352.0
2       b     Bob      ca       4.0  1456.0
3       c  Carlos      mx       2.0  1871.0
4       d  Dieter      de       NaN     NaN

## Lo hacemos en la base de datos:

In [26]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
LEFT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       c  Carlos      mx       2.0  1871.0
2       a   Alice      us       3.0  6352.0
3       b     Bob      ca       4.0  1456.0
4       d  Dieter      de       NaN     NaN

## Quitamos los campos que no queremos:

In [27]:
df_pedidos=pd.merge( df_customers.drop('country', axis=1) , df_orders.drop('order_id', axis=1) , on=['cust_id'], how='left')
df_pedidos

  cust_id    name   total
0       a   Alice  1539.0
1       a   Alice  6352.0
2       b     Bob  1456.0
3       c  Carlos  1871.0
4       d  Dieter     NaN

In [28]:
sSQL = """
SELECT c.cust_id,name, total
FROM   customers c
LEFT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name   total
0       a   Alice  1539.0
1       c  Carlos  1871.0
2       a   Alice  6352.0
3       b     Bob  1456.0
4       d  Dieter     NaN

# RIGHT JOIN

Un **right join devuelve todos los registros de la tabla de la derecha** y los registros que machea de la tabla de la izquierda.

Es decir, la versión x de las columnas (del df de la izquierda) sólo mostraran los valores comunes y missing values, mientras que la versión y de las columnas mostrarán todos los valores, tanto los comunes como los únicos del segundo dataframe

Hacemos el right join de los dos dataset anteriores

![title](http://andresml.sytes.net/resources_classes/right-joins-exp.JPG)


![title](http://andresml.sytes.net/resources_classes/Right-Join.JPG)

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-right-join.jpg)

## Lo hacemos con el DataFrame:

In [9]:
df_pedidos=pd.merge(df_customers,df_orders, on=['cust_id'], how='right')
df_pedidos

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       a   Alice      us         3   6352
2       b     Bob      ca         4   1456
3       c  Carlos      mx         2   1871
4       z     NaN     NaN         5   2137

## Lo hacemos en la base de datos:

In [10]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
RIGHT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       a   Alice      us         3   6352
2       b     Bob      ca         4   1456
3       c  Carlos      mx         2   1871
4    None    None    None         5   2137

## Quitamos los campos que no queremos:

In [31]:
df_pedidos=pd.merge( df_customers.drop('country', axis=1) , df_orders.drop('order_id', axis=1) , on=['cust_id'], how='right')
df_pedidos

  cust_id    name  total
0       a   Alice   1539
1       a   Alice   6352
2       b     Bob   1456
3       c  Carlos   1871
4       z     NaN   2137

In [32]:
sSQL = """
SELECT c.cust_id,name, total
FROM   customers c
RIGHT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name  total
0       a   Alice   1539
1       a   Alice   6352
2       b     Bob   1456
3       c  Carlos   1871
4    None    None   2137

# OUTER JOIN
Con un outer join de dos dataframes conseguimos en general un dataframe con todos los elementos de ambos dataframes.

Es decir, un outer join devuelve **todos los registros si hay un match en cualquiera de las tablas de la derecha o izquierda**

Hacemos el outer join de los dos dataset anteriores:


![title](http://andresml.sytes.net/resources_classes/Full-join.JPG)

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-Outer-Join.jpg)

## Lo hacemos con el DataFrame:

In [37]:
df_pedidos=pd.merge(df_customers,df_orders, on=['cust_id'], how='outer')
df_pedidos

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       a   Alice      us       3.0  6352.0
2       b     Bob      ca       4.0  1456.0
3       c  Carlos      mx       2.0  1871.0
4       d  Dieter      de       NaN     NaN
5       z     NaN     NaN       5.0  2137.0

In [36]:
df_pedidos=pd.merge(df_customers.drop('country', axis=1), df_orders.drop('order_id', axis=1), on=['cust_id'], how='outer')
df_pedidos

  cust_id    name   total
0       a   Alice  1539.0
1       a   Alice  6352.0
2       b     Bob  1456.0
3       c  Carlos  1871.0
4       d  Dieter     NaN
5       z     NaN  2137.0

## Lo hacemos en la base de datos:

In [42]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
LEFT JOIN orders o ON c.cust_id=o.cust_id
UNION
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
RIGHT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       c  Carlos      mx       2.0  1871.0
2       a   Alice      us       3.0  6352.0
3       b     Bob      ca       4.0  1456.0
4       d  Dieter      de       NaN     NaN
5    None    None    None       5.0  2137.0

In [43]:
sSQL = """
SELECT c.cust_id,name, total
FROM   customers c
LEFT JOIN orders o ON c.cust_id=o.cust_id
UNION
SELECT c.cust_id,name, total
FROM   customers c
RIGHT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name   total
0       a   Alice  1539.0
1       c  Carlos  1871.0
2       a   Alice  6352.0
3       b     Bob  1456.0
4       d  Dieter     NaN
5    None    None  2137.0

# Agrupaciones

In [3]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
INNER JOIN orders o ON c.cust_id=o.cust_id
"""
df_pedidos=pd.read_sql(sSQL, con=con)

In [4]:
df_pedidos

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       c  Carlos      mx         2   1871
2       a   Alice      us         3   6352
3       b     Bob      ca         4   1456

Vamos a agrupar por country y calcular la media del total:

In [6]:
df_pedidos.groupby('country')['total'].mean()

country
ca    1456.0
mx    1871.0
us    3945.5
Name: total, dtype: float64

In [7]:
df_pedidos.groupby('country').agg({'total':[np.mean, len]})

          total
           mean len
country
ca       1456.0   1
mx       1871.0   1
us       3945.5   2

In [10]:
sSQL = """
SELECT country,AVG(total),count(*)
FROM (
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
INNER JOIN orders o ON c.cust_id=o.cust_id) a
GROUP BY country

"""
pd.read_sql(sSQL, con=con)

  country  AVG(total)  count(*)
0      ca      1456.0         1
1      mx      1871.0         1
2      us      3945.5         2

In [11]:
con.close()